BrepBuilderErrorsHolder.m_errorMessage
Error message.

BrepBuilderErrorsHolder.m_coedgeId
Coedge ID.

BrepBuilderErrorsHolder.m_edgeId
Edge ID.

BrepBuilderErrorsHolder.m_loopId
Loop ID.

BrepBuilderErrorsHolder.m_faceId
Face ID.

BrepBuilderErrorsHolder.m_shellId
Shell ID.

BrepBuilderErrorsHolder.m_complexId
Complex ID.

BrepBuilderErrorsHolder.m_errorCode
Error code.

BrepBuilderErrorsHolder.#ctor(OdResult,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32!System.Runtime.CompilerServices.IsLong,System.UInt32!System.Runtime.CompilerServices.IsLong,System.UInt32!System.Runtime.CompilerServices.IsLong,System.UInt32!System.Runtime.CompilerServices.IsLong,System.UInt32!System.Runtime.CompilerServices.IsLong,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Creates a new instance of a BrepBuilderErrorsHolder object with given
parameters.
\param errCode   [in] Error code.
\param errMsg    [in] Error message.
\param complexId [in] Complex ID. Optional parameter.
\param shellId   [in] Shell ID. Optional parameter.
\param faceId    [in] Face ID. Optional parameter.
\param loopId    [in] Loop ID. Optional parameter.
\param edgeId    [in] Edge ID. Optional parameter.
\param coedgeId  [in] Coedge ID. Optional parameter.

BrepBuilderErrorsHolder.#ctor
\details
Creates a new instance of a BrepBuilderErrorsHolder object with default
parameters.